ALPHA_VALUE_ERROR = 'Введёное значение альфа не валидно: {0}'
BETA_VALUE_ERROR = 'Введёное значение альфа не валидно: {0}'
ALPHA_BETA_ZERO_ERROR = 'Альфа и бета равны ноль'
VAPORIZE_VALUE_ERROR = 'Введённое значение коэффицикнта испарения феромона не валидно: {0}'
Q_VALUE_ERROR = 'Введёное значение ферамона не валидно: {0}'
CITIES_NUMBER_ERROR = 'Алгоритм не может работать с таким количеством городов: {0}'
ITERATIONS_NUMBER_ERROR = 'Алгоритм не будет работать с таким количеством итераций: {0}'

DISTANCE_NEGATIVE_ERROR = 'ВВедённая дистанция отрицательна: {0}'

PATH_NOT_FOUND_ERROR = 'В введённом графе нет пути'
